In [1]:
import pandas as pd

In [2]:
# read all the csv files
df_ds = pd.read_csv('glassdoor_jobs_ds.csv')  # data scientist
df_analyst = pd.read_csv('glassdoor_jobs_analyst.csv') # data analyst
df_dl = pd.read_csv('glassdoor_jobs_DL.csv') # deep learning engineer
df_ml = pd.read_csv('glassdoor_jobs_ML.csv') # machine learning engineer
df_ba = pd.read_csv('glassdoor_jobs_BA.csv') # business analyst
df_bde = pd.read_csv('glassdoor_jobs_BDE.csv') # big data engineer
df_nlp = pd.read_csv('glassdoor_jobs_NLP.csv') # NLP engineer

In [ ]:
# join all the dataframes
frames = [df_analyst, df_dl, df_ds, df_ml, df_bde, df_ba, df_nlp]
df = pd.concat(frames)

In [82]:
# df.to_csv('glassdoor_jobs_final.csv', index = False)
df = pd.read_csv('glassdoor_jobs_final_1.csv')

# salary parsing

The salary estimate column has the following different values:
1. per month salary
2. range of salary
3. single valued salary
4. data type is not int, so we will convert it
5. some salary range are month wise

In [83]:
def salary_parsing(salary):
    salary = salary.replace('INR ', '').replace(',','')
    if '/mo' in salary:
        salary = int(salary.split('/')[0]) * 12
        min_salary = 0
        max_salary = 0
    elif '-' in salary:
        min_salary = int(salary.split('-')[0].replace('K','')) * 1000
        max_salary = int(salary.split('-')[1].replace('K','')) * 1000
        salary = (min_salary + max_salary)/2
    else:
        salary = int(salary.replace(' ',''))
        min_salary = 0
        max_salary = 0
    if min_salary/10000 < 10:
        min_salary = min_salary *12
    if max_salary/10000 < 10:
        max_salary = max_salary *12
    if salary/10000 < 10:
        salary = salary *12
    return salary, min_salary, max_salary

In [84]:
df['avg_salary'], df['min_salary'], df['max_salary'] = zip(*df['Salary Estimate'].apply(salary_parsing))

In [85]:
df.head()

,Company Name,Competitors,Founded,Headquarters,Industry,Job Description,Job Title,Location,Rating,Revenue,Salary Estimate,Sector,Size,Type of ownership,avg_salary,min_salary,max_salary
0,Punchh\n4.2,-1,2010,-1,Enterprise Software & Network Solutions,"Punchh creates the consistent, modern experien...",Data Analyst,Jaipur,4.2,$50 to $100 million (USD),"INR 6,18,615",Information Technology,201 to 500 Employees,Company - Private,618615.0,0,0
1,"Gensuite, LLC\n3.4",-1,2008,-1,Computer Hardware & Software,Associate Data Analyst\n\nFull Time\nBangalore...,Associate Data Analyst,Bengaluru,3.4,$10 to $25 million (USD),"INR 3,18,709",Information Technology,201 to 500 Employees,Company - Private,318709.0,0,0
2,GroundTruth\n3.4,-1,2009,-1,-1,Role: Junior Data Analyst\n\nLocation: Gurgaon...,Junior Data Analyst,Gurgaon,3.4,Less than $1 million (USD),INR 783K - INR 849K,-1,201 to 500 Employees,Company - Private,816000.0,783000,849000
3,"Amazon.com, Inc.\n4.3",-1,1994,-1,Internet,Amazon Indias Supply Chain & Analytics team is...,Data Analyst Support,Bengaluru,4.3,$10+ billion (USD),"INR 14,39,361",Information Technology,10000+ Employees,Company - Public,1439361.0,0,0
4,"Amazon.com, Inc.\n4.3",-1,1994,-1,Internet,Amazon's Marketplace Trust team works to ensur...,Data Analyst,Bengaluru,4.3,$10+ billion (USD),"INR 14,39,361",Information Technology,10000+ Employees,Company - Public,1439361.0,0,0

In [89]:
print(df[['Company Name', 'avg_salary']][df['avg_salary'] == min(df['avg_salary'])])
print('\n')
print(df[['Company Name', 'avg_salary']][df['avg_salary'] == max(df['avg_salary'])])

                                Company Name  avg_salary
89   MongoDB, Inc. formerly 10gen, Inc.\n4.4    105000.0
118  MongoDB, Inc. formerly 10gen, Inc.\n4.4    105000.0
147  MongoDB, Inc. formerly 10gen, Inc.\n4.4    105000.0
535                        Aurigin Inc.\n4.9    105000.0


           Company Name  avg_salary
397  Conviva, Inc.\n4.1   6278000.0

# Company Name
1. remove the duplicate rows from the data set
2. company name has rating appended, we will split it

In [91]:
df['Company Name'].value_counts()

HP Inc.\n4.1                       29
Netomi\n4.8                        27
Amazon.com, Inc.\n4.3              18
JPMorgan Chase & Co.\n3.9          11
Amazon\n4.3                         9
                                   ..
Bharat Light & Power\n2.5           1
UST Global\n4.2                     1
Finaxar Pte. Ltd.\n3.1              1
Integrity One Technologies\n3.5     1
ITC Infotech India Ltd.\n3.8        1
Name: Company Name, Length: 320, dtype: int64

In [96]:
#drop duplicate rows from the data
df = df.drop_duplicates()

In [107]:
df['Company Name'] = df['Company Name'].astype(str)

In [108]:
df['Company Name'] = df['Company Name'].apply(lambda x: x.split('\n')[0])

# Location column
Location India is vague but no other substitute

In [110]:
df['Location'].value_counts()

Bengaluru              188
Hyderabad               57
Chennai                 43
Pune                    42
Gurgaon                 34
Mumbai                  33
India                   15
Noida                   13
Jaipur                   7
Kochi                    7
New Delhi                7
Ahmedabad                5
Chandigarh               3
Thiruvananthapuram       3
Kolkata                  2
Kanpur Nagar             2
SAS Nagar                2
Andheri                  1
Hiranandani Gardens      1
Vadodara                 1
Ernakulam                1
Chhota Udaipur           1
Coimbatore               1
Indore                   1
Bhubaneswar              1
Kharar                   1
Tamil Nadu               1
Bagalur                  1
Andhra Pradesh           1
Name: Location, dtype: int64

# Company Age

In [111]:
df['Age'] = df.Founded.apply(lambda x: x if x<1 else 2020-x)

# Job description parsing